ymaps.ready(init);

function init() {
    var map = new ymaps.Map("map", {
        center: [55.7558, 37.6176], // Центр карты (Москва)
        zoom: 10
    });

    // точки
    addPointToMap(map,[55.72390114173666, 37.40654759845686],'улица Кубинка (СЗХ)');
    addPointToMap(map,[55.72881462334504, 37.46825986347136],'Рублёвское шоссе');
    addPointToMap(map,[55.7335458736344, 37.50116520366601],'Кутузовский проспект (из центра) - съезд');
    addPointToMap(map,[55.735664608378784, 37.51265042266608],'Кутузовский проспект (из центра) - въезд');
    addPointToMap(map,[55.75055341126577, 37.53218897423594],'ТТК (Москва-Сити)');
    addPointToMap(map,[55.749846945215474, 37.52954431614676],'улица Эрисмана');
    addPointToMap(map,[55.748378755519056, 37.52352074525071],'Шелепихинская набережная');
    addPointToMap(map,[55.74544584639576, 37.53250556880673],'Пресненская набережная');
    addPointToMap(map,[55.73594926245727, 37.51669729942408],'Кутузовский проспект (в центр, м. Парк Победы)');
    addPointToMap(map,[55.3750869560558, 38.33460112229753],'Новорязанское шоссе (юг)');
    addPointToMap(map,[55.381523246954465, 38.31571998649076],'Новорязанское шоссе (север)');
    addPointToMap(map,[55.73994269492299, 37.37246489159132],'МКАД 57 км');
    addPointToMap(map,[55.7266971340468, 37.37923478714475],'МКАД 56 км');
    addPointToMap(map,[55.708321280149306, 37.31813504290098],'Съезд с улицы Чистяковой');
    addPointToMap(map,[55.720655672877484, 37.31645598005749],'Съезд с Рублевского проезда');
    addPointToMap(map,[55.732519014771306, 37.38218828242628],'Молодогвардейская улица');
    addPointToMap(map,[55.69015497104531, 37.27274894415653],'Подушкинское шоссе (юг от М1)');
    addPointToMap(map,[55.6966936485325, 37.26965903937183],'Подушкинское шоссе (север от М1)');
    addPointToMap(map,[55.69043375104677, 37.2566342323957],'Красногорское шоссе (пересечение с Северной улицей)');
    addPointToMap(map,[55.66086861075618, 37.210293170133255],'Можайское шоссе (Дубки)');
    addPointToMap(map,[55.620287205289365, 37.09865251368393],'Крёкшинское шоссе');
    addPointToMap(map,[55.66098384531774, 37.23037755123574],'Можайское шоссе (Акулово)');
    addPointToMap(map,[55.62607098380954, 37.19252446625943],'Минское шоссе (восток)');
    addPointToMap(map,[55.626270793573944, 37.15112590974645],'Рожновка');
    addPointToMap(map,[55.626270793573944, 37.15112590974645],'Рожновка');
    addPointToMap(map,[55.62079366448999, 37.155032644759935],'Кокошкинское шоссе');
    addPointToMap(map,[55.621859102633515, 37.1336760890243],'Ликино');
    addPointToMap(map,[55.621859102633515, 37.1336760890243],'Ликино');
    addPointToMap(map,[55.620287205289365, 37.09865251368393],'Крёкшинское шоссе');
    addPointToMap(map,[55.620287205289365, 37.09865251368393],'Крёкшинское шоссе');
    addPointToMap(map,[55.61370305849855, 37.09953428989552],'Придорожная улица');
    addPointToMap(map,[55.606249092583106, 37.05172432593341],'Минская улица');
    addPointToMap(map,[55.606249092583106, 37.05172432593341],'Минская улица');
    addPointToMap(map,[55.603859733391886, 37.002882065555184],'Петровское шоссе');
    addPointToMap(map,[55.566540781000995, 36.6984630928045],'Наро-Фоминское шоссе (юг от М1)');
    addPointToMap(map,[55.572619987622396, 36.69627709245686],'Наро-Фоминское шоссе (север от М1)');
    addPointToMap(map,[55.566540781000995, 36.6984630928045],'Наро-Фоминское шоссе (юг от М1)');
    addPointToMap(map,[55.572619987622396, 36.69627709245686],'Наро-Фоминское шоссе (север от М1)');

    addLineToMap(map, [[55.602309880569884, 36.99533752953345], [55.60235999201384, 36.99575461303524], [55.60252930745322, 36.997192277067235], [55.60272823319784, 36.99886329328352], [55.602845158529746, 36.99979401981161], [55.60292108389438, 37.00038410579487]], '1423');
    addLineToMap(map, [[55.602134789301864, 36.99564731994024], [55.601941510458126, 36.99478820894169], [55.60180787837249, 36.99424372051171], [55.60169702413131, 36.99383334253244], [55.601540099229176, 36.99329247556875], [55.601289582512216, 36.992496988855756], [55.60118176394103, 36.99214293726576], [55.60111798380467, 36.99191494949949], [55.60106483361149, 36.99168427952422], [55.60104053635624, 36.99146433838499], [55.60103598061309, 36.9912578082908], [55.601051166401156, 36.99111028679499], [55.60108001938225, 36.990957400881136], [55.60110735376572, 36.99085011252053], [55.6011635886353, 36.99070450826829], [55.6012334429773, 36.99058649107163], [55.601301778625626, 36.99049797817409], [55.60136100276882, 36.99044165178481], [55.60144300527199, 36.990385325395515], [55.6015736014957, 36.99035850330535], [55.601680526068606, 36.990352045096046], [55.60178834325703, 36.99038423160421], [55.6018657892228, 36.99044055799354], [55.60197664298504, 36.990569304026245], [55.602058644189675, 36.99073291877615], [55.60213001547372, 36.99092603782523], [55.60216797886953, 36.991095016993164], [55.602192275423505, 36.99125863174307], [55.60220897928948, 36.991432975329026], [55.60221049782295, 36.991604636706], [55.602215053423016, 36.99221618036139], [55.60221960901646, 36.9931254492174], [55.60222264607029, 36.99366993764738], [55.60222872020778, 36.994150053061055], [55.60223479433826, 36.994308303392934], [55.60228035028052, 36.99489570716718], [55.60231072087714, 36.99534095386365]], '1424');
    addLineToMap(map, [[55.6922398859987, 37.27261357925946], [55.69272469308344, 37.27240436695628], [55.69309132443184, 37.272184425817066], [55.69362157027374, 37.27187328957133], [55.69442147032835, 37.27133148335034]], '1425');
}

// Функция для обновления фильтров
function updateFilters(pointName) {
    var fromSelect = document.getElementById('from');
    var toSelect = document.getElementById('to');

    // Если поле "Откуда" пустое, заполняем его, если нет — заполняем поле "Куда"
    if (!fromSelect.value) {
        fromSelect.innerHTML = `<option value="${pointName}">${pointName}</option>`;
    } else if (!toSelect.value) {
        toSelect.innerHTML = `<option value="${pointName}">${pointName}</option>`;
    }
}

// Функция очистки фильтров
function clearFilters() {
    document.getElementById('from').innerHTML = '<option value="">Выберите точку</option>';
    document.getElementById('to').innerHTML = '<option value="">Выберите точку</option>';
    document.getElementById('day').selectedIndex = 0;
    document.getElementById('transponder').checked = false;
    document.getElementById('car').selectedIndex = 0;
}

// Добавляем обработчик для кнопки "Очистить фильтр"
document.getElementById('clearButton').addEventListener('click', clearFilters);

// Функция для добавления точки на карту
function addPointToMap(map, coords, name) {
    // Создаем метку с переданными координатами и названием
    var placemark = new ymaps.Placemark(coords, {
        balloonContent: name
    });

    // Добавляем метку на карту
    map.geoObjects.add(placemark);

    // Обработчик клика на метку для передачи названия в фильтры
    placemark.events.add('click', function () {
        updateFilters(name);
    });
}

function addLineToMap(map, coords, name) {
    // Создаем линию с переданными координатами
    var polyline = new ymaps.Polyline(coords, {
        // Описание содержимого всплывающего окна при клике
        balloonContent: name
    }, {
        // Задаем стиль линии (цвет, ширина и т.д.)
        strokeColor: "#0000FF", // Синий цвет линии
        strokeWidth: 4,         // Ширина линии
        strokeOpacity: 0.7      // Прозрачность линии
    });

    // Добавляем линию на карту
    map.geoObjects.add(polyline);

    // Обработчик клика на линию для показа информации в балуне
    polyline.events.add('click', function () {
        polyline.balloon.open();
    });
}

